In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randint(10, 100, size=(5,5)), 
                  index=list('abcde'), 
                  columns=list('VWXYZ'))

In [3]:
df

    V   W   X   Y   Z
a  13  52  37  56  46
b  17  37  78  11  16
c  64  96  74  92  69
d  53  91  31  86  32
e  25  50  82  80  39

In [4]:
print(df['X']['c'], df.X.c, df['X'].c, df.X['c'], df.X[2])

74 74 74 74 74

In [5]:
print(df.loc['c']['X'], df.loc['c', 'X'], df.loc['c'].X)

74 74 74

In [6]:
print( df.iloc[2, 2], df.iloc[2][2], df.iloc[2].X)

74 74 74

In [7]:
addr = pd.read_csv('data/법정동코드 전체자료.txt', sep='\t', encoding='euc-kr')
addr

            법정동코드                  법정동명 폐지여부
0      1100000000                 서울특별시   존재
1      1111000000             서울특별시 종로구   존재
2      1111010100         서울특별시 종로구 청운동   존재
3      1111010200         서울특별시 종로구 신교동   존재
4      1111010300         서울특별시 종로구 궁정동   존재
...           ...                   ...  ...
46323  5013032022  제주특별자치도 서귀포시 표선면 하천리   존재
46324  5013032023  제주특별자치도 서귀포시 표선면 성읍리   존재
46325  5013032024  제주특별자치도 서귀포시 표선면 가시리   존재
46326  5013032025  제주특별자치도 서귀포시 표선면 세화리   존재
46327  5013032026  제주특별자치도 서귀포시 표선면 토산리   존재

[46328 rows x 3 columns]

In [8]:
addr.isna().sum().sum()

0

In [9]:
addr = addr[(addr.법정동명.str.contains('경기도 수원시')) & (addr.폐지여부.str.contains('존재'))]
addr.head()

           법정동코드             법정동명 폐지여부
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재
4914  4111113000  경기도 수원시 장안구 정자동   존재
4915  4111113100  경기도 수원시 장안구 이목동   존재

In [10]:
addr = addr[addr.법정동명.str.contains('장안구') & addr.법정동명.str.contains('동')]
addr

           법정동코드              법정동명 폐지여부
4913  4111112900   경기도 수원시 장안구 파장동   존재
4914  4111113000   경기도 수원시 장안구 정자동   존재
4915  4111113100   경기도 수원시 장안구 이목동   존재
4916  4111113200   경기도 수원시 장안구 율전동   존재
4917  4111113300   경기도 수원시 장안구 천천동   존재
4918  4111113400   경기도 수원시 장안구 영화동   존재
4919  4111113500   경기도 수원시 장안구 송죽동   존재
4920  4111113600   경기도 수원시 장안구 조원동   존재
4921  4111113700   경기도 수원시 장안구 연무동   존재
4922  4111113800  경기도 수원시 장안구 상광교동   존재
4923  4111113900  경기도 수원시 장안구 하광교동   존재

In [11]:
dong_name = [addr.법정동명.apply(lambda x: x.strip().split()[-1])]
dong_name

[4913     파장동
 4914     정자동
 4915     이목동
 4916     율전동
 4917     천천동
 4918     영화동
 4919     송죽동
 4920     조원동
 4921     연무동
 4922    상광교동
 4923    하광교동
 Name: 법정동명, dtype: object]

In [12]:
dongs = addr['법정동명'].str.strip()
dong_list = []
for dong in dongs:
    dong_list.append(dong.split()[-1])

print(*dong_list, sep=', ')

파장동, 정자동, 이목동, 율전동, 천천동, 영화동, 송죽동, 조원동, 연무동, 상광교동, 하광교동

In [13]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [15]:
# deck 결측치는 너무 많아서 삭제
titanic.drop(columns=['deck'], inplace=True)

In [16]:
# embarked 결측치는 최빈값으로 대체, 가장 많은 값으로의 대체가 무난하다.
titanic.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [17]:
titanic.embarked.fillna('S', inplace=True)
titanic.embarked.value_counts()

S    646
C    168
Q     77
Name: embarked, dtype: int64

In [18]:
titanic.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [19]:
titanic.embark_town.fillna('Southampton', inplace=True)
titanic.embarked.value_counts()

S    646
C    168
Q     77
Name: embarked, dtype: int64

In [23]:
titanic.age.median(), titanic.age.mean()

(28.0, 29.69911764705882)

In [27]:
# age 결측치는 중앙값으로 대체.

titanic.age.fillna(round(titanic.age.median(), 1), inplace=True)

In [28]:
# 세 개의 나이 그룹을 만든다.
titanic['cat'] = pd.qcut(titanic.age, 3, labels=['A1', 'A2', 'A3'])

In [29]:
titanic.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
cat            0
dtype: int64

In [30]:
titanic.groupby(['sex', 'embark_town'])['survived'].agg(['mean'])

                        mean
sex    embark_town
female Cherbourg    0.876712
       Queenstown   0.750000
       Southampton  0.692683
male   Cherbourg    0.305263
       Queenstown   0.073171
       Southampton  0.174603

In [31]:
titanic.pivot_table('age', 'sex')

              age
sex
female  27.929936
male    30.140676

In [32]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone,cat
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False,A1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False,A3
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True,A2
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False,A3
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True,A3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True,A2
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True,A1
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,Southampton,no,False,A2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True,A2
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True,A3